reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]
    if @post.save
---
INSERT INTO "posts" ("title", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "birds"], ["content", "are aite"], ["sub_id", 1], ["author_id", 1], ["created_at", "2019-02-06 00:53:09.845475"], ["updated_at", "2019-02-06 00:53:09.845475"]]

  def update
    @post = current_user.posts.find(params[:id])
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "what if??!??!?!"], ["updated_at", "2019-02-06 01:01:59.777972"], ["id", 4]]