reddit_on_rails/app/controllers/subs_controller.rb

  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update(sub_params)
---
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "Cats And Dogs"], ["updated_at", "2019-02-06 01:03:59.061011"], ["id", 1]]